* Hot  
** TODO Get tax for Indiana 
** TODO Badger
*** TODO ARP
    CLOCK: [2015-08-10 Mon 08:26]--[2015-08-10 Mon 08:26] =>  0:00
+ Calling ARP
*** TODO Concord
    CLOCK: [2015-08-10 Mon 08:26]--[2015-08-10 Mon 08:26] =>  0:00
+ Waiting for email    
*** TODO Range  
    CLOCK: [2015-08-10 Mon 08:26]--[2015-08-10 Mon 08:27] =>  0:01
+ call
*** TODO Tish    
** TODO James, Ticket and Air b&b
   CLOCK: [2015-08-10 Mon 08:21]--[2015-08-10 Mon 08:21] =>  0:00
First place never responded, try again today 

** TODO Go through expenses

*** Sam 
   
*** Tobi Yes

*** Junior Yes

*** Shane Yes

*** Tyler

*** Brad

*** Andrew 
    
*** Matt 

* Cold

** TODO Get Sales Tax set up Texas and Kansas

** TODO Vin # and Tag # 
Tobi is the only one left

** TODO Find Rental In Lindsay

** TODO Sep IRA hassel people

** TODO Sell Truck

** TODO Neosho Collections

** TODO Personal Financial statements
